from app.database.enums import IssueStatus


ISSUE_STATUS_LABELS = {
    IssueStatus.NEW.value: "❌ Не обработано",
    IssueStatus.IN_PROGRESS.value: "🕒 В работе",
    IssueStatus.RESOLVED.value: "✅ Решено",
}

LEXICON: dict[str, str] = {
    "bot_start": (
        "🏙️ Добро пожаловать в «Умный город»!\n\n"
        "Здесь вы сможете сообщить о проблеме в доме, "
        "узнать статус обращения и получить полезную информацию "
        "по вопросам ЖКХ.\n\n"
        "Выберите нужное действие ниже 👇"
    ),

    "help": (
        "ℹ️ С помощью этого бота вы сможете:\n\n"
        "📝 сообщить о проблеме в доме;\n"
        "📸 прикрепить фотографию неисправности;\n"
        "📊 следить за статусом обращения.\n\n"
        "Выберите нужное действие в меню."
    ),

    "send_report": (
        "📝 Опишите проблему, с которой вы столкнулись.\n\n"
        "📸 Можно добавить до 10 фотографий. Присылайте их вместе.\n\n"
        "Например: «На четвёртом этаже не горит лампа у лифта»."
    ),

    "choose_house_send": (
        "🏙️ Выберите дом в котором произошла проблема"
    ),

    "choose_house_view": (
        "🏙️ Выберите дом в котором хотите посмотреть обращения"
    ),

    "invalid_report": (
        "⚠️ Не удалось найти описание проблемы.\n\n"
        "Отправьте текст или фотографию с текстом. "
        "Для отправки заявки нужно подробное описание ✍️"
    ),

    "confirm_report": (
        "📋 Проверьте обращение.\n\n"
        "Всё верно? Отправить его ответственным сотрудникам?"
    ),

    "report_sent": (
        "Описание и прикреплённые фотографии сохранены."
    ),

    "report_cancelled": (
        "❌ Отправка обращения отменена.\n\n"
        "Вы можете отправить жалобу снова либо перейти"
        "в главное меню."
    ),

    "issue_statistics": (
        "📋 Ваши обращения по выбранному дому\n\n\n"
        "ℹ️ Статистика:\n\n"
        "🧮 Всего отправлено: {total}\n"
        "{all_statuses}\n\n\n"
        "📝 Последнее обращение:\n\n"
        "{last_issue}"
    ),
    
    "report_no_house": "⚠️ У Вас нет привязанной квартиры.",
    "report_need_text": "📸 Фото добавлены. Теперь напишите, что случилось — это нужно для отправки заявки.",
    "report_save_error": "⚠️ Не удалось сохранить заявку. Данные оставлены, попробуйте подтвердить ещё раз.",
    "report_invalid_description": "⚠️ Мне нужно подробное текстовое описание к фотографиям",
    
    "yes": "✅ Отправить",
    "no": "↩️ Отменить",
    "back_to_menu": "🔙 Вернуться в главное меню"
}

LEXICON_MAIN_MENU: dict[str, str] = {
    "start": "Открыть главное меню",
    "help": "Помощь по работе с ботом",
}

LEXICON_INLINE_MENU: dict[str, str] = {
    "send_report": "📝 Сообщить о проблеме",
    "my_issues": "🗒️ Мои обращения"
}
